-- 4시 초기화 변수설정                               
-- 사용하려는 변수 1개씩만 -- 삭제하세요
dungeon_name = {'2번','공허','난쟁이','의뢰','3번','공허','난쟁이','의뢰','4번','공허','난쟁이','의뢰','5번','공허','난쟁이','의뢰','1번','공허','난쟁이','의뢰','2번','파티','지하','3번','파티','지하','4번','파티','지하','5번','파티','지하','1번','파티','파티','지하'}
dungeon_floor = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,7,0,2,7,0,2,7,0,2,7,0,1,2,7}
--2b-dungeon_name = {'2번','공허','난쟁이','의뢰','1번','공허','난쟁이','의뢰','2번','파티','지하','1번','파티','파티','지하'}
--2b-dungeon_floor = {0,0,0,0,0,0,0,0,0,2,7,0,1,2,7}
--3b-dungeon_name = {'2번','공허','난쟁이','의뢰','3번','공허','난쟁이','의뢰','의뢰','1번','공허','난쟁이','의뢰','2번','파티','지하','3번','파티','지하','1번','파티','파티','지하'}
--3b-dungeon_floor = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,7,0,2,7,0,1,2,7}
--4b-dungeon_name = {'2번','공허','난쟁이','의뢰','3번','공허','난쟁이','의뢰','4번','공허','난쟁이','의뢰','1번','공허','난쟁이','의뢰','2번','파티','지하','3번','파티','지하','4번','파티','지하','1번','파티','파티','지하'}
--4b-dungeon_floor = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,7,0,2,7,0,2,7,0,1,2,7}
--5배럭-dungeon_name = {'2번','공허','난쟁이','의뢰','3번','공허','난쟁이','의뢰','4번','공허','난쟁이','의뢰','5번','공허','난쟁이','의뢰','1번','공허','난쟁이','의뢰','2번','파티','지하','3번','파티','지하','4번','파티','지하','5번','파티','지하','1번','파티','파티','지하'}
--5배럭-dungeon_floor = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,7,0,2,7,0,2,7,0,2,7,0,1,2,7}
-- 파티던전 난이도(1 보통 , 2 어려움 , 3 매우어려움 , 4 극악)
dungeon_level = 2
-- 파티던전 비공개(0이면 사용안함 / 1이면 사용함)
non_party = 1
-- 마을 의뢰 진행 마을(1 미드 , 2 요툰, 3 니다, 4 알브, 5 무스펠)
start_village = 2
-- 마을 의뢰 종료 후 복귀 마을(1 미드 , 2 요툰, 3 니다, 4 알브, 5 무스펠)
return_village = 3
-- 마을 의뢰 15분 타이머(0이면 사용안함 / 1이면 사용함)
q_timer = 1
-- 입장 후 순줌(0이면 지상이동 / 지상이동은 지하감옥 7, 8층 입구만 지원)
dungeon_telpo = 1
-- 지하감옥 7층 1, 2, 4, 5번방 순간이동(0이면 사용안함 / 1이면 사용함)
dungeon_area = 1






-------- 시스템 변수(수정금지) --------
playmode = 4
initstep = 0
